analogdevicesinc/no-OS/projects/adiol100/src/platform/stm32/main.c
/***************************************************************************//**
 *   @file   main.c
 *   @brief  ADIOL100 project main entry point (STM32 platform).
 *   @author Liviu Stan (liviu.stan@analog.com)
********************************************************************************
 * Copyright 2026(c) Analog Devices, Inc.
 *
 * SPDX-License-Identifier: BSD-3-Clause
*******************************************************************************/

#include "parameters.h"
#include "common_data.h"
#include "no_os_uart.h"
#include "stm32f4xx_hal.h"

#ifdef CONFIG_ADIOL100_BASIC_EXAMPLE
extern int basic_example_main(void);
#endif

#ifdef CONFIG_ADIOL100_ILINK_EXAMPLE
#include "no_os_irq.h"
#include "FreeRTOS.h"
#include "task.h"

extern void xPortSysTickHandler(void);

void SysTick_Handler(void)
{
	HAL_IncTick();
	if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED)
		xPortSysTickHandler();
}

extern int ilink_example_main(void);
#endif

int main(void)
{
	int ret;
	struct no_os_uart_desc *uart;

	adiol100_spi_extra.get_input_clock = HAL_RCC_GetPCLK2Freq;

	stm32_init();

	ret = no_os_uart_init(&uart, &adiol100_uart_ip);
	if (ret)
		return ret;

	no_os_uart_stdio(uart);

#ifdef CONFIG_ADIOL100_BASIC_EXAMPLE
	ret = basic_example_main();
#endif

#ifdef CONFIG_ADIOL100_ILINK_EXAMPLE
	struct no_os_irq_ctrl_desc *nvic_ctrl;

	ret = no_os_irq_ctrl_init(&nvic_ctrl, &nvic_ip);
	if (ret)
		goto uart_remove;

	ret = no_os_irq_enable(nvic_ctrl, NVIC_GPIO_IRQ);
	if (ret)
		goto nvic_remove;

	ret = ilink_example_main();

nvic_remove:
	no_os_irq_ctrl_remove(nvic_ctrl);
uart_remove:
#endif

	no_os_uart_remove(uart);

	return ret;
}
